[
    {
        "name": "Bianca",
        "review": "Marcel is a great driving instructor, his professionalism and hands-on teaching style are exceptional. He focused on areas where I needed the most improvement, and helped me gain confidence behind the wheel. His clear and concise instructions created a stress-free learning environment which was crucial to me passing the driving test first time! I highly recommend Marcel to anyone looking to learn how to drive safely and competently."
    },
    {
        "name": "Sam",
        "review": "When I was learning to drive with Marcel, he allowed me to take my time and learn the correct and safe ways to handle a vehicle on the road. Marcel is a great teacher who is patient and understanding, and when I passed he too was pleased. I will be going back to Marcel for my full licence."
    },
    {
        "name": "Jagruti",
        "review": "When I came from India I had my Indian driving license which I got just before I came. I had barely had any driving experience. I gave my theory test and got my restricted license. I kept driving on restricted license for nearly 10 years and failed test 4 times. Then I met Marcel and he gave me a dozen or so lessons. He has been very patient and taught me safe driving. After taking lessons from him I felt very confident and passed my test in 1 go. I am very thankful to Marcel for getting my driving license and giving me my freedom in case driving. He also helped getting restricted and full license for my daughter. Highly recommended."
    },
    {
        "name": "Jignesh",
        "review": "Marcel is an excellent tutor. He is very patient and focused tutor. He trains his students on his very cool little Prius C. Very punctual about timing as well. He helped my wife and daughter to get their learners through to full license. Highly recommend."
    },
    {
        "name": "Haakon",
        "review": "Marcel is the best driving instructor in Karori. He is very knowledgeable, kind, professional and patient. He helps you develop confidence in your driving abilities. I could not have passed my restricted and full license without him. Cannot recommend him enough.!!!"
    },
    {
        "name": "Rebecca",
        "review": "My partner and I are late bloomers when it comes to getting out licences. When I started lessons I was an anxious driver, my Learners was about to expire and I had very few hours of practical driving behind me. Marcel was just the teacher I needed, calm and patient, he built up my confidence driving around tight Wellington streets and busy highways. Thanks to his support I passed both my restricted and later my full on the first try (on the hardest course in the country)! My partner went on to get his restricted with Marcel a few years later and had the same great experience. I recommend him to anyone who's feeling nervous or has been putting off getting their license sorted, this is your guy!"
    },
    {
        "name": "Ruvini",
        "review": "Exceptional Driving Instructor: Highly Recommended!\nI had the privilege of being trained by Marcel Pfister to obtain my New Zealand driver's license, and I couldn't be more pleased with the experience. From the outset, Marcel demonstrated professionalism, patience, and expertise that truly set him apart.\nAs someone transitioning from a Sri Lankan license, I had concerns about adapting to New Zealand's driving regulations and road conditions. However, Marcel alleviated those concerns with his comprehensive instruction and in-depth knowledge of both driving principles and local driving laws.\nWhat impressed me the most was Marcel's ability to tailor his teaching approach to my individual needs and skill level. He identified areas where I needed improvement and provided clear, constructive feedback to help me progress quickly and confidently. His patience and encouragement were instrumental in building my confidence behind the wheel.\nThanks to Marcel's guidance and support, I was able to pass my New Zealand driving test on the first attempt. His dedication to his students' success is truly commendable, and I am grateful for the invaluable skills and knowledge he imparted to me.\nI wholeheartedly recommend Marcel and Karori Driving School to anyone seeking a driving instructor who is not only highly skilled but also genuinely invested in their students' success. With his expertise and personalized approach, you'll be well-prepared to navigate New Zealand's roads safely and confidently."
    },
    {
        "name": "Shweta",
        "review": "My driving learning experience with Marcel was exceptional. Marcel’s professionalism and attention to the details was just amazing. He not only taught me how to drive safely but also instilled in me a deep understanding of road rules and etiquette of a good driver.\nThanks Marcel, for your driving lessons. I not only passed my restricted and full license test but also feel confident navigating various driving scenarios.\nI wholeheartedly recommend Marcel to anyone seeking top-notch driving classes."
    },
    {
        "name": "Mary",
        "review": "Marcel taught my daughter to drive. She went from being so nervous to being a very confident driver under his kind and patient instruction. She passed her restricted license test first time. Worth every dollar! Thanks Marcel."
    },
    {
        "name": "Celeste",
        "review": "Good teacher, teaches the details needed and helps to prepare for the day. eg lets you know what testers do, if its rubbish day during your test. Passed 100% on my test"
    },
    {
        "name": "Jack",
        "review": "Marcel taught me to drive from having zero experience to passing my restricted. His lessons were always helpful and focused on the areas I needed to improve on. His feedback was very helpful and let me know where I needed to improve."
    },
    {
        "name": "Long",
        "review": "Absolute blast with Marcel! He was very friendly and professional, taught me how to drive from scratch. Highly recommend!"
    },
    {
        "name": "Caleb",
        "review": "Would highly recommend Karori Driving School to anybody whether you are new to driving or haven't driven for a while and need support getting back into it. Sat my restricted and got a 100% pass! Very happy with what I was able to take from Karori Driving School had to offer."
    },
    {
        "name": "Sophia",
        "review": "Just passed my restricted driving test after lessons with Marcel, great teaching I felt really prepared! Would highly recommend"
    },
    {
        "name": "Debadrita",
        "review": "Marcel epitomises patience as a driving instructor. As a mature learner with no prior driving experience, I was apprehensive about starting. Marcel's patience, encouragement, and willingness to adapt to my learning style made all the difference. He not only taught me to become a safe driver but also kept me motivated throughout the process. All that hard work paid off when I obtained my restricted license this month. Thank you, Marcel, for helping me achieve this milestone in New Zealand."
    },
    {
        "name": "Lexzah",
        "review": "Marcel was a great driving instructor. Very patient and chill, but knew when he needed to be firm It made it a breeze to learn to drive. And that really helped to build up the confidence needed to pass."
    },
    {
        "name": "Annabel",
        "review": "Learning to drive with Marcel was great as I gained more confidence and security that what I was doing was correct and would allow me to easily pass my restricted license and be a competent driver. He was very patient and always showed interest in my progression as a learner driver. Could not recommend him enough!"
    },
    {
        "name": "Kate",
        "review": "We are so thankful for Marcel - he has now given driving lessons to two of our children and we have absolutely no hesitation in recommending him. We have really appreciated his patience and calm manner, as well as his general approach to teaching. We have had a very nervous learner driver, and a more confident learner driver and both benefited immensely from Marcel's lessons. Marcel always gave great feedback and encouragement and we had great confidence that they were in safe hands for their driving lessons. Thank you Marcel!"
    },
    {
        "name": "Mahavir",
        "review": "I recently moved to New Zealand and needed to convert my foreign driving license.I had a great experience learning to refine my driving with Karori Driving School, he has been very supportive and very helpful in making me understand the rules, he has been very helpful, professional and punctual. Even though I have been driving for ages, I found it really beneficial to take few sessions and learn the rules and routes of New Zealand. Thank you do much as you really helped in clearing my practical exam in one go."
    },
    {
        "name": "Noa",
        "review": "Marcel has been an incredible driving instructor. His advice was so helpful, and he would always go over areas I was not too confident in. Thanks to his expertise, I was able to pass my restricted first go with no critical errors. Thank you, Marcel!!!"
    },
    {
        "name": "Myer",
        "review": "Would definitely recommend Marcel as a driving instructor! passed with 100% on my restricted test. I have become a much more confident driver through his teaching and I now can feel comfortable on the roads."
    },
    {
        "name": "Eyalla",
        "review": "Would highly recommend Karori Driving School! Marcel taught me many of the skills I needed to pass my restricted license, in which I was able to pass with 100%. Marcel is well knowledged with all the components of driving and helped immensely to build my confidence on the road. I can now say I am a confident driver thanks to Marcel :)"
    },
    {
        "name": "Tanya",
        "review": "Both our boys had driving lessons with Marcel. He always made them feel comfortable and at ease during lessons. They progressed very quickly and he taught them how to be safe and confident drivers. They were well prepared to pass their driving tests. As a parent Marcels communication was excellent and he sent detailed reports on their progress after every lesson. Would definitely recommend Marcel as a driving instructor"
    }
]
