[
    {
        "name": "Bianca",
        "review": "Marcel is a great driving instructor, his professionalism and hands-on teaching style are exceptional. He focused on areas where I needed the most improvement, and helped me gain confidence behind the wheel. His clear and concise instructions created a stress-free learning environment which was crucial to me passing the driving test first time! I highly recommend Marcel to anyone looking to learn how to drive safely and competently."
    },
    {
        "name": "Sam",
        "review": "When I was learning to drive with Marcel, he allowed me to take my time and learn the correct and safe ways to handle a vehicle on the road. Marcel is a great teacher who is patient and understanding, and when I passed he too was pleased. I will be going back to Marcel for my full licence."
    },
    {
        "name": "Jagruti",
        "review": "When I came from India I had my Indian driving license which I got just before I came. I had barely had any driving experience. I gave my theory test and got my restricted license. I kept driving on restricted license for nearly 10 years and failed test 4 times. Then I met Marcel and he gave me a dozen or so lessons. He has been very patient and taught me safe driving. After taking lessons from him I felt very confident and passed my test in 1 go. I am very thankful to Marcel for getting my driving license and giving me my freedom in case driving. He also helped getting restricted and full license for my daughter. Highly recommended."
    },
    {
        "name": "Jignesh",
        "review": "Marcel is an excellent tutor. He is very patient and focused tutor. He trains his students on his very cool little Prius C. Very punctual about timing as well. He helped my wife and daughter to get their learners through to full license. Highly recommend."
    },
    {
        "name": "Haakon",
        "review": "Marcel is the best driving instructor in Karori. He is very knowledgeable, kind, professional and patient. He helps you develop confidence in your driving abilities. I could not have passed my restricted and full license without him. Cannot recommend him enough.!!!"
    },
    {
        "name": "Rebecca",
        "review": "My partner and I are late bloomers when it comes to getting out licences. When I started lessons I was an anxious driver, my Learners was about to expire and I had very few hours of practical driving behind me. Marcel was just the teacher I needed, calm and patient, he built up my confidence driving around tight Wellington streets and busy highways. Thanks to his support I passed both my restricted and later my full on the first try (on the hardest course in the country)! My partner went on to get his restricted with Marcel a few years later and had the same great experience. I recommend him to anyone who's feeling nervous or has been putting off getting their license sorted, this is your guy!"
    },
    {
        "name": "Ruvini",
        "review": "Exceptional Driving Instructor: Highly Recommended!\nI had the privilege of being trained by Marcel Pfister to obtain my New Zealand driver's license, and I couldn't be more pleased with the experience. From the outset, Marcel demonstrated professionalism, patience, and expertise that truly set him apart.\nAs someone transitioning from a Sri Lankan license, I had concerns about adapting to New Zealand's driving regulations and road conditions. However, Marcel alleviated those concerns with his comprehensive instruction and in-depth knowledge of both driving principles and local driving laws.\nWhat impressed me the most was Marcel's ability to tailor his teaching approach to my individual needs and skill level. He identified areas where I needed improvement and provided clear, constructive feedback to help me progress quickly and confidently. His patience and encouragement were instrumental in building my confidence behind the wheel.\nThanks to Marcel's guidance and support, I was able to pass my New Zealand driving test on the first attempt. His dedication to his students' success is truly commendable, and I am grateful for the invaluable skills and knowledge he imparted to me.\nI wholeheartedly recommend Marcel and Karori Driving School to anyone seeking a driving instructor who is not only highly skilled but also genuinely invested in their students' success. With his expertise and personalized approach, you'll be well-prepared to navigate New Zealand's roads safely and confidently."
    },
    {
        "name": "Shweta",
        "review": "My driving learning experience with Marcel was exceptional. Marcel’s professionalism and attention to the details was just amazing. He not only taught me how to drive safely but also instilled in me a deep understanding of road rules and etiquette of a good driver.\nThanks Marcel, for your driving lessons. I not only passed my restricted and full license test but also feel confident navigating various driving scenarios.\nI wholeheartedly recommend Marcel to anyone seeking top-notch driving classes."
    }
]
